/* CSSM Error Names. */

/* The key is the CSSM error code, formatted as an unsigned integer, as defined in various header files */
/* The value is the name of the error. */

/* "Standard" error codes defined by the CDSA spec., found in cssmerr.h. */

/* Apple use the private errors as one of their codes... d'oh. */

2147549184 = "CSSM base error";
2147550208 = "CSSM private error";
2147551232 = "CSP base error";
/* 2147552256 = "CSP private error"; */
2147553280 = "DL/MDS base error";
/* 2147554304 = "DL/MDS private error"; */
2147555328 = "CL base error";
2147556352 = "CL private error";
2147557376 = "TP base error";
/* 2147558400 = "TP private error"; */
2147559424 = "KR base error";
2147560448 = "KR private error";
2147561472 = "AC base error";
2147562496 = "AC private error";

2147549441 = "CSSM invalid add-in handle";
2147549442 = "CSSM not initialized";
2147549443 = "CSSM invalid handle usage";
2147549444 = "CSSM PVC referent not found";
2147549445 = "CSSM function integrity failure";

1 = "CSSM internal error";
2 = "CSSM memory error";
3 = "CSSM MDS error";
4 = "CSSM invalid pointer";
5 = "CSSM invalid input pointer";
6 = "CSSM invalid output pointer";
7 = "CSSM function not implemented";
8 = "CSSM self check failed";
9 = "CSSM OS access denied";
10 = "CSSM function failed";
11 = "CSSM module manifest verify failed";
12 = "CSSM invalid GUID";

32 = "CSSM operation authorization denied";
33 = "CSSM object use authorization denied";
34 = "CSSM object manipulation outhorization denied";
35 = "CSSM object ACL not supported";
36 = "CSSM object ACL required";
37 = "CSSM invalid access credentials";
38 = "CSSM invalid ACL base certificates";
39 = "CSSM ACL base certificates not supported";
40 = "CSSM invalid sample value";
41 = "CSSM sample value not supported";
42 = "CSSM invalid ACL subject value";
43 = "CSSM ACL subject type not supported";
44 = "CSSM invalid ACL challenge callback";
45 = "CSSM ACL challenge callback failed";
46 = "CSSM invalid ACL entry tag";
47 = "CSSM ACL entry tag not found";
48 = "CSSM invalid ACL edit mode";
49 = "CSSM ACL change failed";
50 = "CSSM invalid new ACL entry";
51 = "CSSM invalid new ACL owner";
52 = "CSSM ACL delete failed";
53 = "CSSM ACL replace failed";
54 = "CSSM ACL add failed";

64 = "CSSM invalid context handle";
65 = "CSSM incompatible version";
66 = "CSSM invalid certificate group pointer";
67 = "CSSM invalid certificate pointer";
68 = "CSSM invalid CRL pointer";
69 = "CSSM invalid field pointer";
70 = "CSSM invalid data";
71 = "CSSM CRL already signed";
72 = "CSSM invalid number of fields";
73 = "CSSM verification failure";
74 = "CSSM invalid DB handle";
75 = "CSSM privilege not granted";
76 = "CSSM invalid DB list";
77 = "CSSM invalid DB list pointer";
78 = "CSSM unknown format";
79 = "CSSM unknown tag";
80 = "CSSM invalid CSP handle";
81 = "CSSM invalid DL handle";
82 = "CSSM invalid CL handle";
83 = "CSSM invalid TP handle";
84 = "CSSM invalid KR handle";
85 = "CSSM invalid AC handle";
86 = "CSSM invalid passthrough ID";
87 = "CSSM invalid network address";
88 = "CSSM invalid crypto data";

2147549185 = "CSSM internal error";
2147549186 = "CSSM memory error";
2147549187 = "CSSM MDS error";
2147549188 = "CSSM invalid pointer";
2147549189 = "CSSM invalid input pointer";
2147549190 = "CSSM invalid output pointer";
2147549191 = "CSSM function not implemented";
2147549192 = "CSSM self check failed";
2147549193 = "CSSM OS access denied";
2147549194 = "CSSM function failed";
2147549195 = "CSSM module manifest verify failed";
2147549196 = "CSSM invalid GUID";

2147549248 = "CSSM invalid context handle";
2147549249 = "CSSM incompatible version";
2147549259 = "CSSM privilege not granted";

2147549456 = "CSSM base CSSM error";
2147549457 = "CSSM scope not supported";
2147549458 = "CSSM PVC already configured";
2147549459 = "CSSM invalid PVC";
2147549460 = "CSSM EMM load failed";
2147549461 = "CSSM EMM unload failed";
2147549462 = "CSSM add-in load failed";
2147549463 = "CSSM invalid key hierarchy";
2147549464 = "CSSM add-in unload failed";
2147549465 = "CSSM lib ref not found";
2147549466 = "CSSM invalid add-in function table";
2147549467 = "CSSM EMM authentication failed";
2147549468 = "CSSM add-in authentication failed";
2147549469 = "CSSM invalid service mask";
2147549470 = "CSSM module not loaded";
2147549471 = "CSSM invalid subservice ID";
2147549472 = "CSSM buffer too small";
2147549473 = "CSSM invalid attribute";
2147549474 = "CSSM attribute not in context";
2147549475 = "CSSM module manager initialize fail";
2147549476 = "CSSM module manager not found";
2147549477 = "CSSM event notification callback not found";

2147557377 = "TP internal error";
2147557378 = "TP memory error";
2147557379 = "TP MDS error";
2147557380 = "TP invalid pointer";
2147557381 = "TP invalid input pointer";
2147557382 = "TP invalid output pointer";
2147557383 = "TP function not implemented";
2147557384 = "TP self check failed";
2147557385 = "TP OS access denied";
2147557386 = "TP function failed";

2147557440 = "TP invalid context handle";
2147557442 = "TP invalid certificate group pointer";
2147557443 = "TP invalid certificate pointer";
2147557444 = "TP invalid CRL pointer";
2147557445 = "TP invalid field pointer";
2147557446 = "TP invalid data";
2147557447 = "TP CRL already signed";
2147557448 = "TP invalid number of fields";
2147557449 = "TP verification failure";
2147557450 = "TP invalid DB handle";
2147557452 = "TP invalid DB list";
2147557453 = "TP invalid DB list pointer";
2147557454 = "TP unknown format";
2147557455 = "TP unknown tag";
2147557456 = "TP invalid CSP handle";
2147557457 = "TP invalid DL handle";
2147557458 = "TP/DL invalid CL handle";
2147557462 = "TP invalid passthrough ID";
2147557463 = "TP invalid network address";

2147557632 = "TP base TP error";
2147557633 = "TP invalid caller authentication context pointer";
2147557634 = "TP invalid identifier pointer";
2147557635 = "TP invalid keycache handle";
2147557636 = "TP invalid certificate group";
2147557637 = "TP invalid CRL group";
2147557638 = "TP invalid CRL group pointer";
2147557639 = "TP authentication failed";
2147557640 = "TP certificate group incomplete";
2147557641 = "TP certificate can't operate";
2147557642 = "TP certificate expired";
2147557643 = "TP certificate not valid yet";
2147557644 = "TP certificate revoked";
2147557645 = "TP certificate suspended";
2147557646 = "TP insufficient credentials";
2147557647 = "TP invalid action";
2147557648 = "TP invalid action data";
2147557649 = "TP invalid network address";
2147557650 = "TP invalid anchor certificate";
2147557651 = "TP invalid authority";
2147557652 = "TP verify action failed";
2147557653 = "TP invalid certificate";
2147557654 = "TP invalid certificate authority";
2147557655 = "TP invalid CRL authority";
2147557656 = "TP invalid CRL encoding";
2147557657 = "TP invalid CRL type";
2147557658 = "TP invalid CRL";
2147557659 = "TP invalid form type";
2147557660 = "TP invalid ID";
2147557661 = "TP invalid identifier";
2147557662 = "TP invalid index";
2147557663 = "TP invalid name";
2147557664 = "TP invalid policy identifiers";
2147557665 = "TP invalid time string";
2147557666 = "TP invalid reason";
2147557667 = "TP invalid request inputs";
2147557668 = "TP invalid response vector";
2147557669 = "TP invalid signature";
2147557670 = "TP invalid stop on policy";
2147557671 = "TP invalid callback";
2147557672 = "TP invalid tuple";
2147557673 = "TP not signer";
2147557674 = "TP not trusted";
2147557675 = "TP no default authority";
2147557676 = "TP rejected form";
2147557677 = "TP request lost";
2147557678 = "TP request rejected";
2147557679 = "TP unsupported address type";
2147557680 = "TP unsupported service";
2147557681 = "TP invalid tuple group pointer";
2147557682 = "TP invalid tuple group";

2147561473 = "AC internal error";
2147561474 = "AC memory error";
2147561475 = "AC MDS error";
2147561476 = "AC invalid pointer";
2147561477 = "AC invalid input pointer";
2147561478 = "AC invalid output pointer";
2147561479 = "AC function not implemented";
2147561480 = "AC self check failed";
2147561481 = "AC OS access denied";
2147561482 = "AC function failed";

2147561536 = "AC invalid context handle";
2147561542 = "AC invalid data";
2147561546 = "AC invalid DB handle";
2147561548 = "AC invalid DB list";
2147561549 = "AC invalid DB list pointer";
2147561553 = "AC invalid DL handle";
2147561554 = "AC invalid CL handle";
2147561555 = "AC invalid TP handle";
2147561558 = "AC invalid passthrough ID";

2147561728 = "AC base AC error";
2147561729 = "AC invalid base ACL's";
2147561730 = "AC invalid tuple credentials";
2147561731 = "AC invalid encoding";
2147561732 = "AC invalid validity period";
2147561733 = "AC invalid requestor";
2147561734 = "AC invalid request descriptor";

2147555329 = "CL internal error";
2147555330 = "CL memory error";
2147555331 = "CL MDS error";
2147555332 = "CL invalid pointer";
2147555333 = "CL invalid input pointer";
2147555334 = "CL invalid output pointer";
2147555335 = "CL function not implemented";
2147555336 = "CL self check failed";
2147555337 = "CL OS access denied";
2147555338 = "CL function failed";

2147555392 = "CL invalid context handle";
2147555394 = "CL invalid certificate group pointer";
2147555395 = "CL invalid certificate pointer";
2147555396 = "CL invalid CRL pointer";
2147555397 = "CL invalid field pointer";
2147555398 = "CL invalid data";
2147555399 = "CL CRL already signed";
2147555400 = "CL invalid number of fields";
2147555401 = "CL verification failure";
2147555406 = "CL unknown format";
2147555407 = "CL unknown tag";
2147555414 = "CL invalid passthrough ID";

2147555584 = "CL base CL error";
2147555585 = "CL invalid bundle pointer";
2147555586 = "CL invalid cache handle";
2147555587 = "CL invalid results handle";
2147555588 = "CL invalid bundle info";
2147555589 = "CL invalid CRL index";
2147555590 = "CL invalid scope";
2147555591 = "CL no field values";
2147555592 = "CL scope not supported";

2147553281 = "DL internal error";
2147553282 = "DL memory error";
2147553283 = "DL MDS error";
2147553284 = "DL invalid pointer";
2147553285 = "DL invalid input pointer";
2147553286 = "DL invalid output pointer";
2147553287 = "DL function not implemented";
2147553288 = "DL self check failed";
2147553289 = "DL OS access denied";
2147553290 = "DL function failed";
2147553360 = "DL invalid CSP handle";
2147553361 = "DL invalid DL handle";
2147553362 = "DL invalid CL handle";
2147553357 = "DL invalid DB list pointer";

2147553312 = "DL operation authentication denied";
2147553313 = "DL object use authentication denied";
2147553314 = "DL object manipulation authentication denied";
2147553315 = "DL object ACL not supported";
2147553316 = "DL object ACL required";
2147553317 = "DL invalid access credentials";
2147553318 = "DL invalid ACL base certificates";
2147553319 = "DL ACL base certificates not supported";
2147553320 = "DL invalid sample value";
2147553321 = "DL sample value not supported";
2147553322 = "DL invalid ACL subject value";
2147553323 = "DL ACL subject type not supported";
2147553324 = "DL invalid ACL challenge callback";
2147553325 = "DL ACL challenge callback failed";
2147553326 = "DL invalid ACL entry tag";
2147553327 = "DL ACL entry tag not found";
2147553328 = "DL invalid ACL edit mode";
2147553329 = "DL ACL change failed";
2147553330 = "DL invalid new ACL entry";
2147553331 = "DL invalid new ACL owner";
2147553332 = "DL ACL delete failed";
2147553333 = "DL ACL replace failed";
2147553334 = "DL ACL add failed";

2147553352 = "DL invalid DB handle";
2147553366 = "DL invalid passthrough ID";
2147553367 = "DL invalid network address";

2147553536 = "DL base DL error";
2147553537 = "DL database corrupt";
2147553544 = "DL invalid record index";
2147553545 = "DL invalid record type";
2147553546 = "DL invalid field name";
2147553547 = "DL unsupported field format";
2147553548 = "DL unsupported index info";
2147553549 = "DL unsupported locality";
2147553550 = "DL unsupported number of attributes";
2147553551 = "DL unsupported number of indexes";
2147553552 = "DL unsupported number of record types";
2147553553 = "DL unsupported record type";
2147553554 = "DL field specified multiple";
2147553555 = "DL incompatible field format";
2147553556 = "DL invalid parsing module";

2147553558 = "DL invalid DB name";
2147553559 = "DL data store does not exist";
2147553560 = "DL data store already exists";
2147553561 = "DL DB locked";
2147553562 = "DL data store is open";
2147553563 = "DL record not found";
2147553564 = "DL missing value";
2147553565 = "DL unsupported query";
2147553566 = "DL unsupported query limits";
2147553567 = "DL unsupported number of selection preds";

2147553569 = "DL unsupported operator";
2147553570 = "DL invalid results handle";
2147553571 = "DL invalid DB location";
2147553572 = "DL invalid access request";
2147553573 = "DL invalid index info";
2147553574 = "DL invalid selection tag";
2147553575 = "DL invalid new owner";
2147553576 = "DL invalid record UID";
2147553577 = "DL invalid unique index data";
2147553578 = "DL invalid modify mode";
2147553579 = "DL invalid open parameters";
2147553580 = "DL record modified";
2147553581 = "DL end of data";
2147553582 = "DL invalid query";
2147553583 = "DL invalid value";
2147553584 = "DL multiple values unsupported";
2147553585 = "DL stale unique record";

2147551233 = "CSP internal error";
2147551234 = "CSP memory error";
2147551235 = "CSP MDS error";
2147551236 = "CSP invalid pointer error";
2147551237 = "CSP invalid input pointer error";
2147551238 = "CSP invalid output pointer error";
2147551239 = "CSP function not implemented";
2147551240 = "CSP self-check failed";
2147551241 = "CSP OS access denied";
2147551242 = "CSP function failed";

2147551264 = "CSP operation authorization denied";
2147551265 = "CSP object usage authorization denied";
2147551266 = "CSP object manipulation authorization denied";
2147551267 = "CSP object ACL not supported";
2147551268 = "CSP object ACL required";
2147551269 = "CSP invalid access credentials";
2147551270 = "CSP invalid ACL base certificate(s)";
2147551271 = "CSP ACL base certificate(s) not supported";
2147551272 = "CSP invalid sample value";
2147551273 = "CSP sample value not supported";
2147551274 = "CSP invalid ACL subject value";
2147551275 = "CSP ACL subject type not supported";
2147551276 = "CSP invalid ACL challenge callback";
2147551277 = "CSP ACL challenge callback failed";
2147551278 = "CSP invalid ACL entry tag";
2147551279 = "CSP ACL entry tag not found";
2147551280 = "CSP invalid ACL edit mode";
2147551281 = "CSP ACL change failed";
2147551282 = "CSP invalid new ACL entry";
2147551283 = "CSP invalid new ACL owner";
2147551284 = "CSP ACL delete failed";
2147551285 = "CSP ACL replace failed";
2147551286 = "CSP ACL add failed";

2147551296 = "CSP invalid context handle";
2147551307 = "CSP privilege not granted";
2147551302 = "CSP invalid date";
2147551318 = "CSP invalid passthrough ID";
2147551320 = "CSP invalid crypto data";

2147551488 = "CSP base error";
2147551489 = "CSP input length error";
2147551490 = "CSP output length error";
2147551491 = "CSP privilege not supported";
2147551492 = "CSP device error";
2147551493 = "CSP device memory error";
2147551494 = "CSP attach handle busy";
2147551495 = "CSP not logged in";

2147551506 = "CSP invalid key";
2147551507 = "CSP invalid key reference";
2147551508 = "CSP invalid key class";
2147551509 = "CSP algorithm ID mismatch";
2147551510 = "CSP key usage incorrect";
2147551511 = "CSP key blob type incorrect";
2147551512 = "CSP key header inconsistent";
2147551513 = "CSP unsupported key format";
2147551514 = "CSP unsupported key size";
2147551515 = "CSP invalid key pointer";
2147551516 = "CSP invalid key usage mask";
2147551517 = "CSP unsupported key usage mask";
2147551518 = "CSP invalid key attributes mask";
2147551519 = "CSP unsupported key attribute mask";
2147551520 = "CSP invalid key label";
2147551521 = "CSP unsupported key label";
2147551522 = "CSP invalid key format";

2147551528 = "CSP invalid data count";
2147551529 = "CSP vector of buffers unsupported";
2147551530 = "CSP invalid input vector";
2147551531 = "CSP invalid output vector";

2147551536 = "CSP invalid context";
2147551537 = "CSP invalid algorithm";
2147551542 = "CSP invalid key";
2147551543 = "CSP missing key";
2147551544 = "CSP invalid init vector";
2147551545 = "CSP missing init vector";
2147551546 = "CSP invalid salt";
2147551547 = "CSP missing salt";
2147551548 = "CSP invalid padding";
2147551549 = "CSP invalid padding";
2147551550 = "CSP invalid random data";
2147551551 = "CSP missing random data";
2147551552 = "CSP invalid seed";
2147551553 = "CSP missing seed";
2147551554 = "CSP invalid passphrase";
2147551555 = "CSP missing passphrase";
2147551556 = "CSP invalid key length";
2147551557 = "CSP missing key length";
2147551558 = "CSP invalid block size";
2147551559 = "CSP missing block size";
2147551560 = "CSP staged operation in progress";
2147551561 = "CSP staged operation not started";
2147551562 = "CSP verify failed";
2147551563 = "CSP invalid signature";
2147551564 = "CSP query size unknown";
2147551565 = "CSP block size mismatch";
2147551566 = "CSP private key not found";
2147551567 = "CSP public key inconsistent";
2147551568 = "CSP device verify failed";
2147551569 = "CSP invalid login name";
2147551570 = "CSP already logged in";
2147551571 = "CSP private key already exists";
2147551572 = "CSP key label already exists";
2147551573 = "CSP invalid digest algorithm";
2147551574 = "CSP crypto data callback failed";

2147551588 = "CSP invalid output size";
2147551589 = "CSP missing output size";
2147551590 = "CSP invalid rounds";
2147551591 = "CSP missing rounds";
2147551592 = "CSP invalid algorithm parameters";
2147551593 = "CSP missing algorithm parameters";
2147551594 = "CSP invalid label";
2147551595 = "CSP missing label";
2147551596 = "CSP invalid key type";
2147551597 = "CSP missing key type";
2147551598 = "CSP invalid mode";
2147551599 = "CSP missing mode";
2147551600 = "CSP invalid effective bits";
2147551601 = "CSP missing effective bits";
2147551602 = "CSP invalid start date";
2147551603 = "CSP missing start date";
2147551604 = "CSP invalid end date";
2147551605 = "CSP missing end date";
2147551606 = "CSP invalid version";
2147551607 = "CSP missing version";
2147551608 = "CSP invalid prime";
2147551609 = "CSP missing prime";
2147551610 = "CSP invalid base";
2147551611 = "CSP missing base";
2147551612 = "CSP invalid subprime";
2147551613 = "CSP missing subprime";
2147551614 = "CSP invalid iteration count";
2147551615 = "CSP missing iteration count";
2147551616 = "CSP invalid DL/DB handle";
2147551617 = "CSP missing DL/DB handle";
2147551618 = "CSP invalid access credentials";
2147551619 = "CSP missing access credentials";
2147551620 = "CSP invalid public key format";
2147551621 = "CSP missing public key format";
2147551622 = "CSP invalid private key format";
2147551623 = "CSP missing private key format";
2147551624 = "CSP invalid symmetric key format";
2147551625 = "CSP missing symmetric key format";
2147551626 = "CSP invalid wrapped key format";
2147551627 = "CSP missing wrapped key format";

/* Apple's error codes, defined in cssmapple.h. */

224 = "No User Interaction";
225 = "User Cancelled";
226 = "Service Not Available";
227 = "Insufficient Client Identification";
228 = "Device Reset";
229 = "Device Failed";

2147549408 = "CSSM No User Interaction";
2147549409 = "CSSM User Cancelled";
2147549410 = "CSSM Service Not Available";
2147549411 = "CSSM Insufficient Client Identification";
2147549412 = "CSSM Device Reset";
2147549413 = "CSSM Device Failed";

2147561696 = "AC No User Interaction";
2147561697 = "AC User Cancelled";
2147561698 = "AC Service Not Available";
2147561699 = "AC Insufficient Client Identification";
2147561700 = "AC Device Reset";
2147561701 = "AC Device Failed";

2147551456 = "CSP No User Interaction";
2147551457 = "CSP User Cancelled";
2147551458 = "CSP Service Not Available";
2147551459 = "CSP Insufficient Client Identification";
2147551460 = "CSP Device Reset";
2147551461 = "CSP Device Failed";

2147555552 = "CL No User Interaction";
2147555553 = "CL User Cancelled";
2147555554 = "CL Service Not Available";
2147555555 = "CL Insufficient Client Identification";
2147555556 = "CL Device Reset";
2147555557 = "CL Device Failed";

2147553504 = "DL No User Interaction";
2147553505 = "DL User Cancelled";
2147553506 = "DL Service Not Available";
2147553507 = "DL Insufficient Client Identification";
2147553508 = "DL Device Reset";
2147553509 = "DL Device Failed";

2147557600 = "TP No User Interaction";
2147557601 = "TP User Cancelled";
2147557602 = "TP Service Not Available";
2147557603 = "TP Insufficient Client Identification";
2147557604 = "TP Device Reset";
2147557605 = "TP Device Failed";

/* Apple's private CSP errors, defined in cssmapple.h. */

2147552256 = "Add Application ACL Subject";
2147552257 = "Public Key incomplete";
2147552258 = "Signature mismatch";
2147552259 = "Invalid key start date";
2147552260 = "Invalid key end date";
2147552261 = "DL conversion error (keychain sync failure)";

/* Apple's private DL errors, defined in cssmapple.h. */

2147554304 = "Invalid open parameters";
2147554305 = "Disk full";
2147554306 = "Disk quota exceeded";
2147554307 = "File too big";
2147554308 = "Invalid database blob";
2147554309 = "Invalid key blob";
2147554310 = "Incompatible database blob";
2147554311 = "Incompatible key blob";

/* Apple's private X509 TP errors, defined in cssmapple.h. */

2147558400 = "Hostname mismatch between certificate and provided name";
2147558401 = "Unknown extension encountered with critical flag set - compulsory failure";
2147558402 = "Basic Constraints not provided";
2147558403 = "Invalid CA basic constraints";
2147558404 = "Invalid Authority Key ID";
2147558405 = "Invalid Subject Key ID";
2147558406 = "Invalid Key Usage";
2147558407 = "Invalid Extended Key Usage";
2147558408 = "Invalid Subject/Authority Key ID Linkage";
2147558409 = "Path length constraint exceeded";
2147558410 = "Root certificate did not self-verify";
2147558411 = "CRL expired";
2147558412 = "CRL not valid yet";
2147558413 = "Appropriate CRL not found";
2147558414 = "CRL server down";
2147558415 = "Bad CRL URI";
2147558416 = "Unknown certificate extension";
2147558417 = "Unknown CRL extension";
2147558418 = "CRL not verifiable to anchor or root";
2147558419 = "CRL verifies only to untrusted root";
2147558420 = "CRL failed policy verification";
2147558421 = "IssuingDistributionPoint extension violation";
2147558422 = "Certificate not found at specified issuerAltName";
2147558423 = "Bad certificate obtained from specified issuerAltName";
2147558424 = "S/MIME email address mismatch";
2147558425 = "Appropriate S/MIME ExtendedKeyUsage not found";
2147558426 = "S/MIME KeyUsage incompatibility";
2147558427 = "S/MIME certificate has KeyUsage as non-critical";
2147558428 = "S/MIME certificate has empty subject name and no email address in subjectAltName";
2147558429 = "S/MIME certificate has empty subject name and subjectAltName is not marked as critical";
2147558430 = "Appropriate SSL ExtendedKeyUsage not found";
2147558431 = "Unparseable OCSP response";
2147558432 = "Unparseable OCSP request";
2147558433 = "OCSP service unavailable";
2147558434 = "OCSP response: Certificate not recognised";
2147558435 = "Revocation check not successful for each certificate";
2147558436 = "Network failure (generic error)";
2147558437 = "OCSP response not trusted - could not be verified to a trusted anchor or root";
2147558438 = "OCSP response not trusted - verified to an untrusted root";
2147558439 = "OCSP response not trusted - invalid signature";
2147558440 = "OCSP response not trusted - missing signature";
2147558441 = "OCSP response: Malformed request";
2147558442 = "OCSP response: Internal error";
2147558443 = "OCSP response: Try again later";
2147558444 = "OCSP response: Signature required";
2147558445 = "OCSP response: Unauthorized";
2147558446 = "OCSP response not trusted - nonce did not match request";
2147558447 = "Illegal certificate chain length for Code Signing";
2147558448 = "Missing Basic Constraints for Code Signing";
2147558449 = "Bad PathLengthContraint for Code Signing";
2147558450 = "Missing ExtendedKeyUsage for Code Signing";
2147558451 = "Development style Code Signing certificate detected";

/* Apple's private .Mac TP errors, defined in cssmapple.h. */

2147558500 = ".Mac certificate request queued";
2147558501 = ".Mac request redirected";
2147558502 = ".Mac server reported: General error";
2147558503 = ".Mac server reported: Parameter error";
2147558504 = ".Mac server reported: Authorisation error";
2147558505 = ".Mac server reported: Unimplemented";
2147558506 = ".Mac server reported: Not available";
2147558507 = ".Mac server reported: Already exists";
2147558508 = ".Mac server reported: Service error";
2147558509 = ".Mac request already pending for specified user";
2147558510 = "No .Mac request pending for specified user";